OpenROAD 8d53e9b018dec98fa63e907ddeb6c5406f035361 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /openlane/designs/PrimitiveCalculator/runs/RUN_2022.05.04_12.01.04/tmp/merged_unpadded.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /openlane/designs/PrimitiveCalculator/runs/RUN_2022.05.04_12.01.04/tmp/merged_unpadded.lef
[INFO ODB-0127] Reading DEF file: /openlane/designs/PrimitiveCalculator/runs/RUN_2022.05.04_12.01.04/tmp/floorplan/6-pdn.def
[INFO ODB-0128] Design: PrimitiveCalculator
[INFO ODB-0130]     Created 17 pins.
[INFO ODB-0131]     Created 611 components and 1534 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 1506 connections.
[INFO ODB-0133]     Created 18 nets and 20 connections.
[INFO ODB-0134] Finished DEF file: /openlane/designs/PrimitiveCalculator/runs/RUN_2022.05.04_12.01.04/tmp/floorplan/6-pdn.def
[INFO GPL-0002] DBU: 1000
[INFO GPL-0003] SiteSize: 460 2720
[INFO GPL-0004] CoreAreaLxLy: 5520 10880
[INFO GPL-0005] CoreAreaUxUy: 194120 187680
[INFO GPL-0006] NumInstances: 611
[INFO GPL-0007] NumPlaceInstances: 12
[INFO GPL-0008] NumFixedInstances: 599
[INFO GPL-0009] NumDummyInstances: 0
[INFO GPL-0010] NumNets: 18
[INFO GPL-0011] NumPins: 35
[INFO GPL-0012] DieAreaLxLy: 0 0
[INFO GPL-0013] DieAreaUxUy: 200000 200000
[INFO GPL-0014] CoreAreaLxLy: 5520 10880
[INFO GPL-0015] CoreAreaUxUy: 194120 187680
[INFO GPL-0016] CoreArea: 33344480000
[INFO GPL-0017] NonPlaceInstsArea: 1074780800
[INFO GPL-0018] PlaceInstsArea: 85081600
[INFO GPL-0019] Util(%): 0.26
[INFO GPL-0020] StdInstsArea: 85081600
[INFO GPL-0021] MacroInstsArea: 0
[InitialPlace]  Iter: 1 CG Error: 0.00000005 HPWL: 2508120
[InitialPlace]  Iter: 2 CG Error: 0.00000001 HPWL: 491172
[InitialPlace]  Iter: 3 CG Error: 0.00000000 HPWL: 461538
[InitialPlace]  Iter: 4 CG Error: 0.00000000 HPWL: 444079
[InitialPlace]  Iter: 5 CG Error: 0.00000000 HPWL: 434008
[INFO GPL-0031] FillerInit: NumGCells: 3057
[INFO GPL-0032] FillerInit: NumGNets: 18
[INFO GPL-0033] FillerInit: NumGPins: 35
[INFO GPL-0023] TargetDensity: 0.55
[INFO GPL-0024] AveragePlaceInstArea: 7090133
[INFO GPL-0025] IdealBinArea: 12891151
[INFO GPL-0026] IdealBinCnt: 2586
[INFO GPL-0027] TotalBinArea: 33344480000
[INFO GPL-0028] BinCnt: 32 32
[INFO GPL-0029] BinSize: 5894 5525
[INFO GPL-0030] NumBins: 1024
[NesterovSolve] Iter: 1 overflow: 0.114844 HPWL: 416413
[NesterovSolve] Finished with Overflow: 0.099790
[WARNING STA-0053] /home/emre/ASIC/pdk/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib line 1, library sky130_fd_sc_hd__tt_025C_1v80 already exists.
###############################################################################
# Created by write_sdc
# Wed May  4 12:01:09 2022
###############################################################################
current_design PrimitiveCalculator
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {restart}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rotary_a}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rotary_b}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {select}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_flag}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {seven_segment_digit}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {seven_segment_out[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {seven_segment_out[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {seven_segment_out[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {seven_segment_out[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {seven_segment_out[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {seven_segment_out[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {seven_segment_out[6]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {led_flag}]
set_load -pin_load 0.0334 [get_ports {seven_segment_digit}]
set_load -pin_load 0.0334 [get_ports {seven_segment_out[6]}]
set_load -pin_load 0.0334 [get_ports {seven_segment_out[5]}]
set_load -pin_load 0.0334 [get_ports {seven_segment_out[4]}]
set_load -pin_load 0.0334 [get_ports {seven_segment_out[3]}]
set_load -pin_load 0.0334 [get_ports {seven_segment_out[2]}]
set_load -pin_load 0.0334 [get_ports {seven_segment_out[1]}]
set_load -pin_load 0.0334 [get_ports {seven_segment_out[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {restart}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rotary_a}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rotary_b}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {select}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
[INFO]: Setting RC values...
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
Startpoint: _04_ (rising edge-triggered flip-flop clocked by clk)
Endpoint: _04_ (rising edge-triggered flip-flop clocked by clk)
Path Group: clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.15    0.00    0.00 ^ _04_/CLK (sky130_fd_sc_hd__dfxtp_2)
                  0.05    0.34    0.34 ^ _04_/Q (sky130_fd_sc_hd__dfxtp_2)
     2    0.01                           clok_divider.clk_div (net)
                  0.05    0.00    0.34 ^ _02_/A (sky130_fd_sc_hd__nor2_2)
                  0.02    0.03    0.38 v _02_/Y (sky130_fd_sc_hd__nor2_2)
     1    0.00                           _00_ (net)
                  0.02    0.00    0.38 v _04_/D (sky130_fd_sc_hd__dfxtp_2)
                                  0.38   data arrival time

                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                                  0.25 ^ _04_/CLK (sky130_fd_sc_hd__dfxtp_2)
                         -0.01    0.24   library hold time
                                  0.24   data required time
-----------------------------------------------------------------------------
                                  0.24   data required time
                                 -0.38   data arrival time
-----------------------------------------------------------------------------
                                  0.14   slack (MET)


Startpoint: _05_ (rising edge-triggered flip-flop)
Endpoint: seven_segment_digit (output port clocked by clk)
Path Group: clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.05    0.00    0.00 ^ _05_/CLK (sky130_fd_sc_hd__dfxtp_2)
                  0.13    0.38    0.38 v _05_/Q (sky130_fd_sc_hd__dfxtp_2)
     2    0.04                           seven_segment_digit (net)
                  0.13    0.00    0.39 v seven_segment_digit (out)
                                  0.39   data arrival time

                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                         -2.00   -1.75   output external delay
                                 -1.75   data required time
-----------------------------------------------------------------------------
                                 -1.75   data required time
                                 -0.39   data arrival time
-----------------------------------------------------------------------------
                                  2.14   slack (MET)


min_report_end
max_report

===========================================================================
report_checks -path_delay max (Setup)
============================================================================
Startpoint: _05_ (rising edge-triggered flip-flop)
Endpoint: seven_segment_digit (output port clocked by clk)
Path Group: clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.05    0.00    0.00 ^ _05_/CLK (sky130_fd_sc_hd__dfxtp_2)
                  0.27    0.51    0.51 ^ _05_/Q (sky130_fd_sc_hd__dfxtp_2)
     2    0.04                           seven_segment_digit (net)
                  0.27    0.00    0.51 ^ seven_segment_digit (out)
                                  0.51   data arrival time

                  0.15   10.00   10.00   clock clk (rise edge)
                          0.00   10.00   clock network delay (ideal)
                         -0.25    9.75   clock uncertainty
                          0.00    9.75   clock reconvergence pessimism
                         -2.00    7.75   output external delay
                                  7.75   data required time
-----------------------------------------------------------------------------
                                  7.75   data required time
                                 -0.51   data arrival time
-----------------------------------------------------------------------------
                                  7.24   slack (MET)


Startpoint: rst (input port clocked by clk)
Endpoint: _04_ (rising edge-triggered flip-flop clocked by clk)
Path Group: clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          2.00    2.00 ^ input external delay
                  0.17    0.13    2.13 ^ rst (in)
     2    0.04                           rst (net)
                  0.17    0.00    2.13 ^ _02_/B (sky130_fd_sc_hd__nor2_2)
                  0.03    0.04    2.17 v _02_/Y (sky130_fd_sc_hd__nor2_2)
     1    0.00                           _00_ (net)
                  0.03    0.00    2.17 v _04_/D (sky130_fd_sc_hd__dfxtp_2)
                                  2.17   data arrival time

                  0.15   10.00   10.00   clock clk (rise edge)
                          0.00   10.00   clock network delay (ideal)
                         -0.25    9.75   clock uncertainty
                          0.00    9.75   clock reconvergence pessimism
                                  9.75 ^ _04_/CLK (sky130_fd_sc_hd__dfxtp_2)
                         -0.08    9.67   library setup time
                                  9.67   data required time
-----------------------------------------------------------------------------
                                  9.67   data required time
                                 -2.17   data arrival time
-----------------------------------------------------------------------------
                                  7.50   slack (MET)


max_report_end
check_report

===========================================================================
report_checks -unconstrained
============================================================================
Startpoint: _05_ (rising edge-triggered flip-flop)
Endpoint: seven_segment_digit (output port clocked by clk)
Path Group: clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.05    0.00    0.00 ^ _05_/CLK (sky130_fd_sc_hd__dfxtp_2)
                  0.27    0.51    0.51 ^ _05_/Q (sky130_fd_sc_hd__dfxtp_2)
     2    0.04                           seven_segment_digit (net)
                  0.27    0.00    0.51 ^ seven_segment_digit (out)
                                  0.51   data arrival time

                  0.15   10.00   10.00   clock clk (rise edge)
                          0.00   10.00   clock network delay (ideal)
                         -0.25    9.75   clock uncertainty
                          0.00    9.75   clock reconvergence pessimism
                         -2.00    7.75   output external delay
                                  7.75   data required time
-----------------------------------------------------------------------------
                                  7.75   data required time
                                 -0.51   data arrival time
-----------------------------------------------------------------------------
                                  7.24   slack (MET)



===========================================================================
report_checks --slack_max -0.01
============================================================================
No paths found.
check_report_end
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack 7.24

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack 0.14
worst_slack_end
clock_skew

===========================================================================
 report_clock_skew
============================================================================
Clock clk
Latency      CRPR       Skew
_04_/CLK ^
   0.01
_04_/CLK ^
   0.01      0.00       0.00

clock_skew_end
power_report

===========================================================================
 report_power
============================================================================
Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power
----------------------------------------------------------------
Sequential             4.73e-06   7.42e-07   1.69e-11   5.48e-06  95.4%
Combinational          1.88e-07   7.76e-08   4.51e-10   2.66e-07   4.6%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  4.92e-06   8.20e-07   4.68e-10   5.74e-06 100.0%
                          85.7%      14.3%       0.0%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 1160 u^2 3% utilization.
area_report_end
