OpenROAD 8d53e9b018dec98fa63e907ddeb6c5406f035361 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /openlane/designs/PrimitiveCalculator/runs/RUN_2022.05.04_12.01.04/tmp/merged_unpadded.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /openlane/designs/PrimitiveCalculator/runs/RUN_2022.05.04_12.01.04/tmp/merged_unpadded.lef
[INFO ODB-0127] Reading DEF file: /openlane/designs/PrimitiveCalculator/runs/RUN_2022.05.04_12.01.04/tmp/placement/7-global.def
[INFO ODB-0128] Design: PrimitiveCalculator
[INFO ODB-0130]     Created 17 pins.
[INFO ODB-0131]     Created 611 components and 1534 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 1506 connections.
[INFO ODB-0133]     Created 18 nets and 20 connections.
[INFO ODB-0134] Finished DEF file: /openlane/designs/PrimitiveCalculator/runs/RUN_2022.05.04_12.01.04/tmp/placement/7-global.def
###############################################################################
# Created by write_sdc
# Wed May  4 12:01:09 2022
###############################################################################
current_design PrimitiveCalculator
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {restart}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rotary_a}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rotary_b}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {select}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_flag}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {seven_segment_digit}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {seven_segment_out[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {seven_segment_out[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {seven_segment_out[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {seven_segment_out[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {seven_segment_out[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {seven_segment_out[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {seven_segment_out[6]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {led_flag}]
set_load -pin_load 0.0334 [get_ports {seven_segment_digit}]
set_load -pin_load 0.0334 [get_ports {seven_segment_out[6]}]
set_load -pin_load 0.0334 [get_ports {seven_segment_out[5]}]
set_load -pin_load 0.0334 [get_ports {seven_segment_out[4]}]
set_load -pin_load 0.0334 [get_ports {seven_segment_out[3]}]
set_load -pin_load 0.0334 [get_ports {seven_segment_out[2]}]
set_load -pin_load 0.0334 [get_ports {seven_segment_out[1]}]
set_load -pin_load 0.0334 [get_ports {seven_segment_out[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {restart}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rotary_a}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rotary_b}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {select}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
[INFO]: Setting RC values...
[INFO RSZ-0027] Inserted 1 input buffers.
[INFO RSZ-0028] Inserted 1 output buffers.
[INFO RSZ-0058] Using max wire length 2319um.
[INFO RSZ-0039] Resized 6 instances.
[INFO RSZ-0042] Inserted 2 tie sky130_fd_sc_hd__conb_1 instances.
[INFO RSZ-0042] Inserted 6 tie sky130_fd_sc_hd__conb_1 instances.
Placement Analysis
---------------------------------
total displacement         54.5 u
average displacement        0.1 u
max displacement            6.8 u
original HPWL             383.2 u
legalized HPWL            431.5 u
delta HPWL                   13 %

[INFO DPL-0020] Mirrored 5 instances
[INFO DPL-0021] HPWL before             431.5 u
[INFO DPL-0022] HPWL after              425.9 u
[INFO DPL-0023] HPWL delta               -1.3 %
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
Startpoint: _04_ (rising edge-triggered flip-flop clocked by clk)
Endpoint: _04_ (rising edge-triggered flip-flop clocked by clk)
Path Group: clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.15    0.00    0.00 ^ _04_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.07    0.34    0.34 ^ _04_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.01                           clok_divider.clk_div (net)
                  0.07    0.00    0.34 ^ _02_/A (sky130_fd_sc_hd__nor2_1)
                  0.03    0.04    0.38 v _02_/Y (sky130_fd_sc_hd__nor2_1)
     1    0.00                           _00_ (net)
                  0.03    0.00    0.38 v _04_/D (sky130_fd_sc_hd__dfxtp_1)
                                  0.38   data arrival time

                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                                  0.25 ^ _04_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.02    0.23   library hold time
                                  0.23   data required time
-----------------------------------------------------------------------------
                                  0.23   data required time
                                 -0.38   data arrival time
-----------------------------------------------------------------------------
                                  0.16   slack (MET)


Startpoint: _05_ (rising edge-triggered flip-flop)
Endpoint: seven_segment_digit (output port clocked by clk)
Path Group: clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.07    0.00    0.00 ^ _05_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.10    0.34    0.34 v _05_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.02                           net2 (net)
                  0.10    0.00    0.34 v output2/A (sky130_fd_sc_hd__buf_2)
                  0.09    0.19    0.54 v output2/X (sky130_fd_sc_hd__buf_2)
     1    0.03                           seven_segment_digit (net)
                  0.09    0.00    0.54 v seven_segment_digit (out)
                                  0.54   data arrival time

                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.25    0.25   clock uncertainty
                          0.00    0.25   clock reconvergence pessimism
                         -2.00   -1.75   output external delay
                                 -1.75   data required time
-----------------------------------------------------------------------------
                                 -1.75   data required time
                                 -0.54   data arrival time
-----------------------------------------------------------------------------
                                  2.29   slack (MET)


min_report_end
max_report

===========================================================================
report_checks -path_delay max (Setup)
============================================================================
Startpoint: _05_ (rising edge-triggered flip-flop)
Endpoint: seven_segment_digit (output port clocked by clk)
Path Group: clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.07    0.00    0.00 ^ _05_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.19    0.44    0.44 ^ _05_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.02                           net2 (net)
                  0.19    0.00    0.44 ^ output2/A (sky130_fd_sc_hd__buf_2)
                  0.18    0.26    0.70 ^ output2/X (sky130_fd_sc_hd__buf_2)
     1    0.03                           seven_segment_digit (net)
                  0.18    0.00    0.70 ^ seven_segment_digit (out)
                                  0.70   data arrival time

                  0.15   10.00   10.00   clock clk (rise edge)
                          0.00   10.00   clock network delay (ideal)
                         -0.25    9.75   clock uncertainty
                          0.00    9.75   clock reconvergence pessimism
                         -2.00    7.75   output external delay
                                  7.75   data required time
-----------------------------------------------------------------------------
                                  7.75   data required time
                                 -0.70   data arrival time
-----------------------------------------------------------------------------
                                  7.05   slack (MET)


Startpoint: rst (input port clocked by clk)
Endpoint: _04_ (rising edge-triggered flip-flop clocked by clk)
Path Group: clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.15    0.00    0.00   clock clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          2.00    2.00 ^ input external delay
                  0.02    0.01    2.01 ^ rst (in)
     1    0.00                           rst (net)
                  0.02    0.00    2.01 ^ input1/A (sky130_fd_sc_hd__buf_2)
                  0.16    0.19    2.20 ^ input1/X (sky130_fd_sc_hd__buf_2)
     2    0.03                           net1 (net)
                  0.16    0.00    2.20 ^ _02_/B (sky130_fd_sc_hd__nor2_1)
                  0.04    0.06    2.26 v _02_/Y (sky130_fd_sc_hd__nor2_1)
     1    0.00                           _00_ (net)
                  0.04    0.00    2.26 v _04_/D (sky130_fd_sc_hd__dfxtp_1)
                                  2.26   data arrival time

                  0.15   10.00   10.00   clock clk (rise edge)
                          0.00   10.00   clock network delay (ideal)
                         -0.25    9.75   clock uncertainty
                          0.00    9.75   clock reconvergence pessimism
                                  9.75 ^ _04_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.08    9.67   library setup time
                                  9.67   data required time
-----------------------------------------------------------------------------
                                  9.67   data required time
                                 -2.26   data arrival time
-----------------------------------------------------------------------------
                                  7.41   slack (MET)


max_report_end
check_report

===========================================================================
report_checks -unconstrained
============================================================================
Startpoint: _05_ (rising edge-triggered flip-flop)
Endpoint: seven_segment_digit (output port clocked by clk)
Path Group: clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.07    0.00    0.00 ^ _05_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.19    0.44    0.44 ^ _05_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.02                           net2 (net)
                  0.19    0.00    0.44 ^ output2/A (sky130_fd_sc_hd__buf_2)
                  0.18    0.26    0.70 ^ output2/X (sky130_fd_sc_hd__buf_2)
     1    0.03                           seven_segment_digit (net)
                  0.18    0.00    0.70 ^ seven_segment_digit (out)
                                  0.70   data arrival time

                  0.15   10.00   10.00   clock clk (rise edge)
                          0.00   10.00   clock network delay (ideal)
                         -0.25    9.75   clock uncertainty
                          0.00    9.75   clock reconvergence pessimism
                         -2.00    7.75   output external delay
                                  7.75   data required time
-----------------------------------------------------------------------------
                                  7.75   data required time
                                 -0.70   data arrival time
-----------------------------------------------------------------------------
                                  7.05   slack (MET)



===========================================================================
report_checks --slack_max -0.01
============================================================================
No paths found.
check_report_end
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack 7.05

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack 0.16
worst_slack_end
clock_skew

===========================================================================
 report_clock_skew
============================================================================
Clock clk
Latency      CRPR       Skew
_04_/CLK ^
   0.01
_04_/CLK ^
   0.01      0.00       0.00

clock_skew_end
power_report

===========================================================================
 report_power
============================================================================
Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power
----------------------------------------------------------------
Sequential             4.64e-06   4.16e-07   1.69e-11   5.06e-06  85.6%
Combinational          2.46e-07   6.07e-07   4.59e-10   8.53e-07  14.4%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  4.89e-06   1.02e-06   4.76e-10   5.91e-06 100.0%
                          82.7%      17.3%       0.0%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 1162 u^2 3% utilization.
area_report_end
